Script started on Wed 02 May 2018 11:32:46 PM EDT
asantos@franklin:~/cs451/asn7$ prolog
GNU Prolog 1.3.0
By Daniel Diaz
Copyright (C) 1999-2007 Daniel Diaz
| ?- [appends].
compiling /home/asantos/cs451/asn7/appends.pl for byte code...
/home/asantos/cs451/asn7/appends.pl compiled, 63 lines read - 1992 bytes written, 9 ms

yes
| ?- second(X, [1,2,3]]).

X = 2

yes
| ?- second(2, [1,2,3,4].

yes
| ?- second(2, X).

X = [_,2|_]

yes
| ?- lastElm(X, [1,2,3]).

X = 3 ? ;

no
| ?- lastElm(3, [1,2,3]).

true ? ;

no
| ?- lastElm(3, X).

X = [3] ? ;

X = [_,3] ? ;

X = [_,_,3] ? ;

X = [_,_,_,3] ? ;

-- Will keep on going as long as 3 is the last element of the list. --

| ?- allButLast(X, [1,2,3]).

X = [1,2] ? ;

no
| ?- allButLast([1,2], [1,2,3]).

yes
| ?- allButLast([1,2], X).

X = [1,2,_]

yes
| ?- concat_three(X, [[1,2],[1,2],[1,2]]).

X = [1,2]

yes
| ?- concat_three([1,2], [[1,2],[1,2],[1,2]]).

yes
| ?- concat_three([1,2], X).

X = [[1,2],[1,2],[1,2]]

yes
| ?- ins(A, [1,2,3], [1,2,3,5]).

A = 5 ? ;

no
| ?- ins(5, [1,2,3], X).

X = [5,1,2,3] ? ;

X = [1,5,2,3] ? ;

X = [1,2,5,3] ? ;

X = [1,2,3,5] ? ;

no
| ?- ins(5, [1,2,3], [1,2,3,5]).

true ? ;

no
| ?- halt.
asantos@franklin:~/cs451/asn7$ exit
exit

Script done on Wed 02 May 2018 11:40:17 PM EDT

-- Inputs done based on Tests as commented in the program. --
